
USE my_library;
-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 10, 2024 at 01:23 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `my_library`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--
DROP TABLE IF EXISTS books; 
CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `author` varchar(255) NOT NULL,
  `genre` varchar(255) DEFAULT NULL,
  `pages` int(11) NOT NULL,
  `content` text NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `image` blob DEFAULT NULL,
  `language` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `author`, `genre`, `pages`, `content`, `user_id`, `image`, `language`) VALUES
(5, 'Глюкозната революция', 'Джеси Инчауспе', 'Хранене', 304, '           Отслабнете. Спрете пристъпите на глад и яжте всичко, каквото обичате.\r\n\r\nОпирайки се на над 300 научни изследвания, на собствения си опит, както и на преживяното от своите съмишленици, развенчавайки митове и утвърдени от години схващания, Джеси Инчауспе ни запознава с революционното въздействие, което оказва балансираната кръвна захар върху здравето и благополучието ни. Десет прости съвета са помогнали на хора със здравословни проблеми да подобрят състоянието си, да възвърнат формата и енергията си. Диабетиците, сърдечно болните, преждевременно състарените, хората със свръхтегло, вечно гладните, преуморените, потиснатите, тревожните могат отново да се радват на живота единствено като спазват хаковете на Джеси, при това без никакви съсипващи диети, като ядат всичко, което обичат и в каквито количества желаят. Звучи невероятно, но е факт. Джеси Инчауспе и богините на глюкозата са го доказали.\r\n\r\nЧетириседмична подробна и конкретна програма за здравословен и щастлив живот на Джеси Инчауспе включваща 100 рецепти можеш да откриеш в Методът на глюкозната богиня!', 9, 0x313733333833323131345f312e6a7067, 'Български'),
(6, 'Размирни години', 'Мито Анков', 'Българска история', 252, '   Спомените на Мито Анков представят на читателя дългия и трънлив път на нашето Освобождение. Авторът е председател на Врачанския революционен комитет и придружава Васил Левски и Димитър Общи по време на агитационните им обиколки. Впоследствие се записва в Българското опълчение и проявява особен героизъм в решителните сражения при Стара Загора, Шипка и Шейново.\r\n\r\nРазказът на врачанския апостол ни дава възможност да разберем по най-добрия начин духа на възрожденската епоха. Той изтъква решаващата роля на българите за спечелването на Освободителната война и възстановяването на държавността. Заветът му за безкористна служба на Отечеството завладява сърцата на следващите поколения, участвали във Войните за национално обединение.\r\n\"Нашата сотня беше изложена на най-голяма опасност, защото трябваше и да се сражава, и да разнася заповеди от генерала до дружинните командири. Но конниците изпълниха с мъжество и решителност своя най-голям отечествен дълг, както го изпълниха и всички опълченци, твърдо уверени, че освободеното потомство ще ги възнагради с признателност за техните славни подвизи.\"\r\nМито Анков', 4, 0x313733333430303131325f626f6f6b322e6a7067, 'Български'),
(7, 'Да прецакаш дявола', 'Наполеон Хил', 'Личностно развитие', 272, '  Наполеон Хил e познат на милиони хора като автор на книгата „Мисли и забогатявай” – най-продаваната книга за самоусъвършенстване в света. Малко след излизането й, през 1938 г., той пише „Да прецакаш Дявола”. Ръкописът на новата книга съдържа изпълнено с изключителни прозрения за човешката природа интервю с Дявола. Смятана за твърде скандална и противоречива от семейството на автора, книгата така и не вижда бял свят и остава скрита.\r\n\r\nСега, повече от 70 години след написването ѝ, тя най-накрая намира пътя към своите читатели благодарение на фондация „Наполеон Хил” и редакцията и коментарите на Шарън Лехтър – съавтор на книгата „Богат татко, беден татко”.\r\n\r\n \r\n\r\n„Да прецакаш Дявола”, по думите на самия Хил, дава на човек ключа към затвора, в който той сам се е поставил. Основната й ценност е, че тя очертава разликата между човека, който се носи по течението на живота без цел и посока, и онзи, който използва най-ценния си ресурс – своя ум, за да управлява живота си и да постига целите си. Както бизнес консултантът Брайън Трейси правилно отбелязва, ако „Мисли и забогатявай“ е картата по пътя към успеха, то „Да прецакаш Дявола“ ще помогне на хората да се освободят от бариерите, които вероятно им пречат да постигнат този успех.\r\n\r\nНаполеон Хил е човек, който знае как да накара другите да се замислят. Затова той веднага ни въвлича в приключението – превежда ни през своя собствен живот и споделя за два повратни момента в него. Това са периоди на личностни кризи, объркване и безпътица, оказали се впоследствие решаващи за неговите бъдещи успехи, тъй като илюстрират неизменен житейски принцип:\r\n\r\n \r\n\r\n„Причината за успеха не е нещо отделно и външно от самия човек. Тя е сила, толкова неуловима, че повечето хора не я различават; сила, която спокойно може да бъде наречена „другото ни Аз“. Забележителното е, че тази сила се проявява и става видима много рядко – само при изключителни обстоятелства, когато хората са били принудени – след преживяване на голяма беда или временен провал – да променят нагласите си и да мислят по начин, който да им помогне да излязат от затруднено положение”.\r\n\r\n \r\n\r\nТези идеи разкриват една друга част от същността на Наполеон Хил. Въпреки че е основно познат като „създател на милионери”, книгата му „Да прецакаш Дявола” е не само наръчник за постигане на успех; тя ни предоставя пътните знаци към решаването на житейски проблеми и преодоляване на сериозни кризи. В нея той говори за връзката между благосъстоянието и духовното пробуждане, за това, че успехът е пряко следствие от способността на човек да слуша вътрешния си глас, да превръща временния провал в крайна победа и да акумулира мъдрост, преодолявайки препятствията.\r\n\r\nДяволът е основният персонаж във втората част на книгата. Дяволът е вечният символ на злото, онази негативна енергия, която живее в човешките умове и пречи на хората да осъществят мечтите си. Сега, по някакъв необикновен начин, той сякаш е поставен на свидетелска скамейка в съд и е принуден да разкрие своя пълен арсенал от „номера” и машинации. В интервюто с него Дяволът описва в детайли всички онези фактори, чрез които ние, хората, възпрепятстваме собственото си щастие – страхове, негативни мисли, вредни навици, склонност към мързел, отлагане и отчаяние, и разкрива как те могат да бъдат преодолени.\r\n\r\n', 4, 0x313733333430303233355f626f6f6b312e6a7067, 'Български'),
(8, 'Път през умовете', 'Димитър Миленков', 'Личностно развитие', 358, '       \"Много пъти бях чувал, че мисълта е посредникът между света около нас и чувствата вътре в нас, както и че, ако променим мисълта, можем да променим и света. Но някак тази фина връзка оставаше скрита и аз продължавах да виждам чувствата си, без да забелязвам, че те са резултат от мислите ми. Живеех с усещането, че чувствата ми зависят от другите хора, от случките и преживяванията ми в миналото, от това, което можеше да ми се случи в бъдеще... Искайки да променя начина, по който се чувствах, вместо да променям мислите си, се опитвах да променя миналото, бъдещето, хората, света... себе си. Всичко това ми костваше много усилия и правеше живота ми труден за преживяване.\"\r\nДимитър Миленков\r\nПът през умовете е книга, в която през истории на различни хора можеш да се докоснеш и да разбереш природата на мисълта и силата ѝ да сътворява преживяванията ни. Именно това познание е помогнало на героите в книгата да постигнат щастие и просперитет. Да се освободят от страховете, които сами са си създавали. Да живеят в разбирателство със себе си и хората около себе си. Да достигнат до собствената си вътрешна мъдрост, която да се превърне в най-добрия им съветник.', 9, 0x313733333833323132335f322e6a7067, 'Български'),
(11, 'Госпожата', 'Е. Л. Джеймс', 'Роман', 448, ' Продължение на бестселъра „Господинът“ – вълнуваща и страстна любовна история от авторката на феноменалната трилогия „Петдесет нюанса“.\r\n\r\n \r\n\r\nМаксим Тревелян, граф на Треветик, и страстен донжуан, открива любимата си сред странностите на Албания. След като се е борил за нея и я е спечелил, сега трябва да се ожени под дулото на пушка.\r\n\r\n Само че дали от поправил се развратник от Максим ще излезе добър съпруг? Дали славата му на покровител на женските сърца и скандалните тайни на аристократичното му семейство няма да съсипят щастието, което е открил?\r\n\r\n Алесия Демачи се е опълчила на похитителите си и трафиканти на хора и е спечелила сърцето на мъжа, когото обича, но дали ще успее да опази брака си? Когато се сблъсква с цветистото минало на Максим и стряскащото му семейство, с шушукането в лондонското общество, дали ще я приемат като графинята на Максим, или завинаги ще си остане неговата чистачка?\r\n\r\n От величествените планини на Албания през идилията на английската провинция до блясъка на съвременен Лондон „Госпожата“ е впечатляващо пътешествие за любов, копнеж, приемане и спасение.\r\nКакво се случва, след като стъклената пантофка ти стане?\r\n', 10, 0x313733333833303734325f352e6a7067, 'Български'),
(12, 'Господинът', 'Е. Л. Джеймс', 'Роман', 464, ' „Господинът“ е вълнуващият нов роман на Е Л Джеймс, авторка на феноменалната бестселър трилогия „Петдесет нюанса“.\r\n\r\nЛондон, 2019 г. Животът на Максим Тревелян е лек. Той е красив аристократ, богат, никога не е работил и рядко спи сам. Всичко това се променя, когато той внезапно наследява семейната титла, богатство и имения - както и всички отговорности. Максим не е подготвен за тази роля.\r\n\r\nНай-голямото предизвикателство обаче е да се пребори с тайнствена млада жена, наскоро пристигнала в Англия, която притежава единствено опасно и проблемно минало. Въздържана, красива, със забележителен музикален талант, тя е огромно изкушение и у Максим пламва страст, каквато не е изпитвал досега. Коя е Алесия Демачи? Може ли Максим да я защити от злите сили, които я заплашват? Какво ще направи тя, когато научи, че и той крие тайни?\r\n\r\nОт сърцето на Лондон през красивия провинциален Корнуол и суровата, стряскаща красота на Балканите „Господинът“ ви подема като вълна през опасности и страст, които оставят читателя без дъх до последната страница.', 10, 0x313733333833303833335f362e6a7067, 'Български'),
(13, 'Mixed Signals', 'B.K. Borison', 'Роман', 336, ' A small-town baker learns to raise her expectations for love with some help from a handsome local teacher in this sunny romantic comedy.\r\n\r\nLayla Dupree has given up on love. She’s waded through all the fish in the sea, each one more disappointing than the last. Apparently, owning the bakery at Inglewild’s most romantic destination does not help one’s love life—despite Layla’s best efforts. All she wants is a partner who gives her butterflies, not someone who ghosts her at dinner and leaves her with the check.\r\n\r\nGood thing Caleb Alvarez has the perfect solution. After saving Layla from another date gone bad, he has a simple proposition: one month of no-strings dating. He’ll do his best to renew her faith in men while she rates his romantic game. It’s a win-win situation. All the benefits of dating without the added pressure of feelings and unmet expectations.\r\n\r\nBut there’s one ingredient they haven’t considered. The chemistry between them is red-hot, and the urge to take things to the next level is more tempting than Layla’s mocha fudge brownies. ', 10, 0x313733333833313238315f372e6a7067, 'English'),
(14, 'Както си го направиш - наръчник за първи срещи', 'Емилия Стоянова', 'Психология и философия', 79, '  Омръзнало ли ви е да губите време и нерви с неподходящи мъже?\r\n\r\nЕто и малките тайни, с които да го разкриете!\r\n\r\nЛесно и бързо ще разберете още по време на първите срещи:\r\n\r\nКакъв е той наистина?;\r\nКак ще се държи във връзката ви?;\r\nКак ще ви говори пред другите?;\r\nКак ще реагира по време на спор?;\r\nМоже ли да разчитате на него?;\r\nКои са трите типа мъже, които да избягвате?;\r\nЩе откриете сценарии и разговори – как да се държите и как да отговорите.;\r\nНай-големите грешки, които допускат жените.;\r\nКак да предизвикаме и поддържаме интереса му?', 10, 0x313733333833313431325f382e6a7067, 'Български'),
(15, 'Моят ментор', 'Наполеон Хил', 'Личностно развитие', 204, ' Вечни принципи, които ще ви изведат на ново ниво на успех.\r\n\r\nЗапознайте се с двама необикновени души - Наполеон Хил и Дон Грийн.\r\n\r\nНаполеон Хил е автор на една от най-великите книги за личностно развитие \"Мисли и забогатявай\", чиито идеи са основополагащи за всички следващи автори в областта на самоусъвършенстването. Роден е на 26 октомври 1883 г. в град Паунд, в Апалачите, щата Вирджиния. Чрез своите книги Хил успява да предаде не просто теоретично знание, а практически принципи, които променят живота на много хора и ги извеждат на пътя към високите постижения в личния и професионалния живот.\r\n\r\nЕдин от тези хора е Дон Грийн - син на миньор, също роден в град в Апалачите - Стратън, щата Вирджиния. Благодарение на предприемаческия си дух, той поставя началото на първото си бизнес начинание едва на 15-годишна възраст - събира такса от желаещите да видят мечката му - домашен любимец. На 42 години оглавява небанкова финансова институция, а наближавайки 60-годишнината си, Дон приема поста изпълнителен директор на фондация \"Наполеон Хил\" и успява да изведе работата на фондацията на ново ниво на успех.\r\n\r\nЗа съжаление, Наполеон Хил и Дон Грийн никога не се срещат. Но Дон приема Наполеон Хил за свой ментор, защото успява да разбере - и по-важното - д', 10, 0x313733333833313534325f392e6a7067, 'Български'),
(16, 'Метаморфоза. Промени тялото и живота си', 'Боян Мавров', 'Личностно развитие', 216, ' \"Тази книга е за всички хора, които са изпитвали трудности с тренировките. Тя е за тези, които искат да подобрят знания, уменията и най-вече - тялото си. Ще научите кои са най-често допусканите грешки при тренировките и как да процедирате, когато прогресът спре. Ако искате да разберете по какъв начин да структурирате тренировките си и какви упражнения да избирате според вашата цел - отслабване и/или покачване на мускулна маса, то тази книга е за вас. Ще научите и как да наблягате на определени мускулни групи, като специално за дамите има отделна глава за изграждането на дупе и тренировки по време на и след бременност. Целта на книгата е да развенчае всички митове за силовите тренировки, особено при дамите. Всеки може да бъде силен и да изглежда добре!\"\r\nБоян Мавров\r\n\r\n\"Боян е един от най-начетените хора на тема фитнес в България. Няколко пъти съм се консултирал с него да прегледа наши материали. Това, което ми харесва най-много, е деликатният баланс между научно-потвърдени методи и все по-напредничави методи, които не се прилагат масово!\"\r\nНикола Томов, основател на Aesthetic by Science\r\nПътят на Боян започва от ранното му детство, като дете с наднормено по това време тегло. Търпи много подигравки и по това време именно Арнолд Шварценегер става негов идол. Впоследствие отслабва и постига добра форма, като се посвещава на това да помага на другите хора да изглеждат и да се чувстват добре - както физически, така и с психически. Мисията си започва през 2016 година, като от тогава служи в полза на хората, Вярва в непрестанния растеж и постоянно се старае да обогатява знанията и уменията си.', 10, 0x313733333833313632335f31302e6a7067, 'Български'),
(17, 'Гладът - приятел и лекарство', 'Лидия Ковачева', 'Хранене', 376, ' \"Първото ми запознанство с гладолечението беше в неговата строга класическа форма. При тежките ми заболявания (туберкулоза на белите дробове, цироза на черния дроб, миокардит, язва на дванадесетопръстника и още много други) кризите бяха неизбежни. В нашата страна нямаше специалисти в тази област и клиника, където да бъда лекувана.\r\n\r\nНепрекъснатото експериментирах върху себе си и върху моите приятели сътрудници. Плодовете, топличките чайове, медът - всички те, признати с целебната си сила, оформиха моята система. Бях постигнала това, към което се стремях - лечение леко - и по силите на всеки.\r\n\r\nОказа се, че плодово-чаеният разтоварващ режим е единственото лечение при голям брой хронични заболявания. С напредването на експерименталната работа и сега списъкът на излекуваните болни продължава да се увеличава. За плодово-чаения разтоварващ режим, обявен за национално постижение, заслугата не е само моя, а и на моите съмишленици и пациенти.\"\r\nЛидия Ковачева', 10, 0x313733333833313737375f31312e6a7067, 'Български'),
(18, 'Тихите убийци на мозъка', 'Дейвид Пърлмътър', 'Хранене', 320, ' Прочутият невролог Дейвид Пърлмътър представя медицинско откритие, което твърде дълго бе пренебрегвано: въглехидратите могат да разрушат мозъка. Дори така наречените здравословни въглехидрати, като пълнозърнестите продукти, могат да причинят деменция, синдром на дефицит на внимание и хиперактивност, епилепсия, тревожност, хронично главоболие, депресия, понижено либидо и още много проблеми.\r\n\r\nСъдбата на мозъка ви не зависи от гените ви, а от храната, която ядете. Основата на всички дегенеративни заболявания, включително и на мозъчните, е възпалението, а то може да се провокира от въглехидрати - особено от онези от тях, които съдържат глутен и много захар. Ще видите какво става, когато мозъкът се срещне със съставките на всекидневната филия хляб или купата с плодове, как най-вероятно статините изтриват вашата памет, защо диетата, богата на добри мазнини, е идеална и как да стимулирате растежа на нови мозъчни клетки на всяка възраст.\r\n\r\nРеволюционната 4-седмична програма, която д-р Пърлмътър описва тук, показва как да запазите здравето на мозъка си, намалявайки драстично риска от неврологични заболявания, и то без лекарства. Прочутият невролог представя хитри стратегии и вкусни рецепти, чрез които с лекота ще изпълните програмата. Запознава ви с най-новите медицински постижения, разказва истински случаи от своята богата клинична практика и дава практични съвети как да управлявате своите умни гени, да възвърнете доброто си здраве и благополучие и да се радвате на дълъг живот, изпълнен с енергия и добро настроение.\r\n\r\nСъвременната пшеница е причинила повече поражения на мозъка, отколкото инсултите, автомобилните катастрофи и травмите на главата, взети заедно.', 10, 0x313733333833313836315f31322e6a7067, 'Български'),
(19, 'Яжте мръсно!', 'Джош Акс', 'Хранене', 384, ' Как да се справите с чревната пропускливост - основната причина за здравословните ви проблеми!\r\n\r\nС хиляди последователи по цял свят и личен диетолог на олимпийски шампиони като Майкъл Фелпс, д-р Акс представя революционния си подход и на българските читатели.\r\n\r\nДа ядете мръсно? Сигурно с погнуса потръпвате при мисълта за това. Не се тревожете - никой не очаква от вас да ядете боклук или пръст, или поне не буквално! Философията \"Яжте мръсно\" включва здравословен начин на хранене и живот, с който да преборите синдрома на чревната пропускливост - основната причина за множество разпространени болести. Водещ експерт по функционална медицина и автор на програмата, д-р Джош Акс ни призовава да се върнем към забравени, но доказани във времето навици, сред които контактът с \"мръсната\" природа.\r\n\r\nОт книгата ще научите:\r\nкои са основните причини за чревната пропускливост и връзката ѝ с редица сериозни болести: от хранителни алергии и автоимунни заболявания до забавен метаболизъм, хронична умора и депресия;\r\nкак да ограничите вредите от консумацията на високопреработени и ГМО продукти, употребата на лекарствени медикаменти и дезинфекциращи препарати;\r\nкои храни и добавки ще ви помогнат да се справите с чревната пропускливост;\r\nкак употребата на етерични масла и забравени лекове от природата ще преобрази живота ви;\r\nкой индивидуализиран лечебен протокол да изберете според петте типа чревна пропускливост;\r\nкакто и много любопитна информация, ценни съвети, рецепти, тестове и бонуси.', 10, 0x313733333833313931305f31332e6a7067, 'Български'),
(20, 'Чудото колаген', 'Джош Акс', 'Хранене', 304, ' ​План за отлично здраве, оптимално тегло и видимо подмладяване.\r\n\r\n​Колагенът е най-разпространеният протеин в човешкото тяло и е от критично значение за състоянието на костите и ставите, възстановяването на тъканите, оптималното функциониране на имунната система и червата. С възрастта обаче синтезът на колаген в организма рязко намалява и недостигът му става все по-осезаем - ставни болки, бръчки и отпусната кожа, влошено храносмилане, неспокоен сън, наднормено тегло. Тези и още редица други признаци сочат, че е време да започнете да си набавяте достатъчно количество от този ценен протеин.\r\n\r\nКато се опира на последни научни изследвания, в тази книга Джош Акс разкрива благотворния ефект от приема на колаген (от естествени източници или под формата на висококачествени хранителни добавки). Освен че описва полезните свойства на колагена, той разглежда необходимите предпоставки за максималното му усвояване. Предложени са и две програми с колаген: 3-дневен пречистващ план и 28-дневен режим, както и рецепти към тях.\r\n\r\nДжош Акс е хиропрактор, сертифициран експерт по натурална медицина и клиничен нутриционист. През 2008 г. основава център по функционална медицина в Нашвил. Неговият уебсайт DrAxe.com е в топ десет на най-посещаваните и четени здравни уебсайтове в света.', 10, 0x313733333833313936365f31342e6a7067, 'Български'),
(21, 'Храната като лек', 'д-р Уилям Ли', 'Хранене', 384, ' Открийте как храната помага на тялото да се предпази от множество болести и да се самолекува.\r\n\r\nОтдавна подценяваме силата на тялото да се променя и възстановява. В своята революционна книга д-р Уилям Ли напомня за тази наша способност с безброй доказателства. Той описва над 200 храни с почти вълшебни свойства: те могат да изтощят рака от глад, да намалят риска от деменция и да предотвратят редица болести.\r\n\r\n\"Храната като лек\" не ви казва кои храни да изключите, а кои храни да включите в менюто си, за да бъдете здрави. Храни като сливи, хляб с квас, зехтин, канела, черен боб и други са леснодостъпни, а имат почти вълшебни свойства. Книгата разглежда подробно стотици лечебни храни, които всъщност са ви любими. Д-р Ли предлага прост, но много ефикасен модел: пет защитни системи на организма, пет храни и пет хранения на ден. Гъвкав и лесноприложим, с него любимите ви храни ще активират петте природни системи за защита на здравето - ангиогенеза, регенерация, микробиом, защита на ДНК и имунитет. Така ще успеете да се преборите с рака, диабета, сърдечносъдовите, невродегенеративните и автоимунните заболявания, както и с други сериозни или по-леки болести.\r\n\r\nЕдновременно информативна и много практична, съдържаща научни доказателства и лесни рецепти за вкусни ястия, \"Храната като лек\" обяснява новата наука за лечение и профилактика, представяйки механизмите, по които храната стимулира защитните ни сили.', 10, 0x313733333833323033325f31352e6a7067, 'Български'),
(22, 'Мисли и забогатявай', 'Наполеон Хил', 'Личностно развитие', 288, ' Когато „Мисли и забогатявай“ се появява за пръв път през 1937 г., тя незабавно си спечелва славата на една от най-великите и вдъхновяващи книги на своето време. Творбата на Наполеон Хил става задължително четиво за всички, които се стремят към успех в живота и кариерата си, до момента тя е продадена в над петнадесет милиона екземпляра, превръща се в пътеводител за милиони хора, решили да се отърват от бедността в епоха на депресия и да постигнат просперитет за себе си, за семействата си, а в много случаи – и за своите работодатели.\r\n\r\n\"Богатството е на една ръка разстояние, никога не е късно да станете такива, каквито винаги сте мечтали, парите, славата, признанието и щастието са достъпни за всички, които са готови и решени да се сдобият с тях.\r\nОткъде знам всичко това ли? Ще разберете, преди да сте затворили последната страница на книгата. Не познавам човек, изпитал вдъхновението от тайната, който да не е постигал забележителен успех в областта, за която е бил призван. От друга страна, не съм срещал човек, който да се е отличил или да е натрупал каквото и да е богатство, за което да си струва да се говори, без да е разполагал с тази тайна. Въз основа на тези два факта стигам до заключението, че сред знанията, необходими за нашето себеутвърждаване, тайната е много по-важна от всичко, което получаваме в хода на така нареченото си образование...\"', 4, 0x313733333833323238395f31362e6a7067, 'Български'),
(23, 'Атомни навици', 'Джеймс Клиър', 'Личностно развитие', 360, ' Минимална промяна, забележителни резултати. Лесен и доказан начин да си изградим добри навици и да се избавим от лошите хора.\r\n\r\nАтомни навици предлага доказана стратегия за успех. Независимо дали сте лидер, който иска най-доброто за екипа си, атлет, който се готви за състезание, или просто човек, който не може да откаже цигарите, да свали някой килограм или да намали стреса в живота си - тази книга ще ви помогне да постигнете целите си стъпка по стъпка.\r\n\r\nДжеймс Клиър, един от водещите експерти по изграждане на навици, разказва как удивителните постижения всъщност са резултат от дребни на пръв поглед, но значими промени в поведението ни.\r\n\r\nВъртите се в омагьосан кръг от вредни навици? Проблемът не е у вас. Проблемът е в системата, която използвате. Често лошите навици биват повтаряни отново и отново. Не защото не искаме да се променим, а защото ни липсва правилен подход. Атомни навици дава отговор на въпроса как да променим поведението си, така че да се отърсим от нежеланите привички и да запазим онези, които допринасят за доброто ни физическо и емоционално здраве.\r\n\"Превъзходно практична и полезна книга. Джеймс Клиър представя най-основната информация за изграждането на навици, за да може вие да постигнете повече с по-малко усилия.\"\r\nМарк Менсън, автор на Тънкото изкуство да не ти пука', 4, 0x313733333833323335325f31372e6a7067, 'Български'),
(24, 'Тънкото изкуство да не ти пука', 'Марк Менсън', 'Личностно развитие', 224, ' Повечето хора мечтаят за безоблачно щастие, вечна любов, привлекателна външност, вдъхновяваща и високоплатена работа... Накратко - живот, за който останалите да им завиждат. Социалните мрежи и консуматорската ни култура постоянно подхранват този фалшив идеал за щастие. Гарантираните начини да го постигнем обаче все повече заприличват на сапунен мехур, който авторът на тази книга спуква, като заявява смело: \"Целият този сладникав позитивизъм и радостни врели-некипели за самопомощ наблягат най-вече на това, което ви липсва. Ключът към добрия живот е да не ви пука за това да трупате още и още, а да ви пука само за истинските и важните неща\".\r\n\r\nПреди да осъзнаем това обаче, трябва да осмислим голяма част от неприятните истини и да имаме реалистични очаквания. Марк Менсън развенчава редица установени житейски правила и прави доста шокиращи заявления, докато ни въвежда в тънкостите на изкуството да не ни пука.', 4, 0x313733333833323431305f31382e6a7067, 'Български'),
(25, 'Всичко е прецакано', 'Марк Менсън', 'Личностно развитие', 320, ' От автора на световната книжна сензация и най-продавана книга в България за 2018 г. - Тънкото изкуство да не ти пука.\r\n\r\nНикога досега хората не са живели толкова добре: световната икономика процъфтява, образованието и здравните грижи стават все по-достъпни, масовото потребление на луксозни стоки бележи небивал растеж. В същото време се отчитат рекордни нива на неудовлетворение от живота, депресия и самоубийства. В този свят, където всичко изглежда прецакано, може ли да се надяваме на нещо добро? Още по-провокативен и безкомпромисен, Марк Менсън анализира кризите на съвременното общество и дава необичайно предложение за преодоляването им.\r\n\r\nВместо да търсиш надежда, опитай следното: Не се надявай. Но не се и отчайвай. Не се ласкай, че изобщо знаеш нещо. Точно тази сляпа, пламенна и емоционална увереност ни вкарва в подобна неразбория. Не се надявай на по-добро. Просто бъди по-добър.', 4, 0x313733333833323436355f31392e6a7067, 'Български'),
(26, 'ЗАбогатявай с душевно спокойствие', 'Наполеон Хил', 'Личностно развитие', 304, ' Още изумителни тайни от човека, който даде на милиони читатели ключа към щастието и успеха. В тази мъдра и вълнуваща книга прочутият автор на \"Мисли и забогатявай\" Наполеон Хил споделя последните си открития как да получим всичко, което искаме, и да се възползваме от него, като запазим хармонията в живота си. В нея на прост и разбираем език са представени техники, които ще ви помогнат да се сдобиете със силата да печелите пари и да се радвате на истинско душевно спокойствие.\r\n\r\nТук ще научите как:\r\nда успявате в живота и да бъдете себе си;\r\nда развиете свое собствено солидно его;\r\nда печелите приятелство и трайна обич;\r\nда си изградите мисловна нагласа, която ще ви донесе богатство и душевно спокойствие;\r\nда получите работата, която искате, и да продължите нагоре;\r\nда се сдобиете със самоувереност и вътрешна движеща сила;\r\nда превръщате всяко предизвикателство в нов успех.\r\n\r\nТази книга ще ви помогне да спечелите всички пари, от които се нуждаете, обогатявайки всяка страна на живота си.', 4, 0x313733333833323536375f32302e6a7067, 'Български'),
(27, 'Богат татко, беден татко', 'Робърт Кийосаки', 'Личностно развитие', 360, ' Уроците за парите, на които богатите учат децата си, а бедните и средната класа - не. Робърт Кийосаки промени начина, по който милиони хора по света мислят за парите. Той притежава репутация на човек, чиито възгледи често противоречат на конвенционалното мислене със своята смелост и безкомпромисна откровеност. Той е световно признат експерт по финансова грамотност.\r\n\"Главната причина хората да имат финансови затруднения е, че те прекарват години в учене в училище, без да научат нищо за парите. резултатът е, че се учат да работят за пари... но изобщо не се научават как да накарат парите да работят за тях.\"\r\n\r\n\"Аз имах двама бащи - единият богат, а другият - беден. Единият беше високообразован и интелигентен. Имаше докторска степен и бе завършил за по-малко от две години четиригодишния курс на бакалавърското обучение. След това бе продължил учението си в Станфордския университет, Чикагския университет и Северозападния университет на пълна стипендия.\r\n\r\nДругият ми баща не беше завършил осми клас. И двамата мъже се бяха радвали на успех в кариерата си и бяха работили здраво през целия си живот. И двамата печелеха значителни доходи. Но единият имаше финансови трудности непрестанно. Другият стана един от най-богатите хора на Хаваите. След смъртта си единият остави десетки милиони долари на семейството си, на благотворителни каузи и на своята църква. Другият остави след смъртта си сметки за плащане.\r\n\r\nИ двамата бяха силни, харизматични и влиятелни личности. И двамата ми даваха съвети, но не съветваха едно и също. И двамата вярваха силно в образоването, но не препоръчваха една и съща учебна програма. Ако имах само един баща, изборът ми щеше да бъде дали да приема или да отхвърля неговия съвет. Но тъй като имах двама татковци, имах възможност да избирам между две контрастни гледни точки: едната - на богат човек, а другата - на беден човек.\"\r\nРобърт Кийосаки', 9, 0x313733333833323732325f32312e6a7067, 'Български'),
(28, 'Известният непознат', 'Петър Стоянович', 'Българска история', 696, ' Животът и дейността на Иван Стоянович - Аджелето през историята на модерна България (1862 - 1947).\r\n\r\nЖивотът на Иван Стоянович, по прякор Аджелето, е история на съзиданието на свободна България след 1878 г. Периодът, в който се ражда и утвърждава модерната държава след петстотингодишно робство. Строежът на всичкото от нищото. Поколения, през които нихилизмът се плаши от националното опиянение; когато котерийната борба все пак не смогва да засенчи морала и мярката; овчедушието и цинизмът не са пуснали метастази във всеки орган на държавното и общественото; и когато, най-сетне, общият стремеж е обединен около националния идеал, моралът - около Бог, а обществото - около човешкото достойнство.\r\n\r\nПроф. дин Петър Стоянович е журналист, политик, министър на културата в 92-рото правителство, заемал е и висши партийни постове в СДС и в ПП Движение Гергьовден. Следва Германистика в Софийския университет Св. Климент Охридски, завършва Обща история и История на Източна и Югоизточна Европа във Виенския университет. Защитава с отличие докторска степен - доктор по философия на Виенския университет (1998). Защитава с отличие най-висшето научно звание доктор на историческите науки (2015).', 9, 0x313733333833323934365f32312e6a7067, 'Български'),
(29, 'King Ferdinand of Bulgaria', 'Peter Stoyanovich', 'Българска история', 788, ' And the Europeanisation of Bulgaria. Presented in selected areas of state administration and society (1861 - 1887 - 1912).\r\n\r\nThe book is a thorough narrative of the modernization of Bulgaria from 1887 to 1912. One period of 25 years of Bulgaria\'s peaceful existence, apart from the social turmoil. In these years Bulgaria went from being an Ottoman Asian province to a European state. This was, of course, the consequence of a great popular, especially elitist, push towards Europe, led by the Bulgarian ruler - Prince, later Tsar, Ferdinand I. His participation in this great upsurge is the subject of this book. It is the crowning achievement of years of research of mine, which found publication in separate smaller books, but it is now the crowning achievement of this work, said Prof. Stoyanovich.', 9, 0x313733333833333031365f312e6a7067, 'English'),
(30, 'Алманах. Васил Левски - Стратег и творец на революцията', 'Пламен Павлов', 'Българска история', 384, ' В многовековната история на България е изграден истински пантеон от бележити личности: владетели и държавници, политически и духовни водачи, писатели, художници, военачалници, в по-ново време и учени, музиканти, спортисти...\r\n\r\nЗа българската нация, обаче, първостепенна личност категорично е стратегът и творец, и водачът на националната революция Васил Левски, човекът, който още за своите съвременници е олицетворение на волята за свобода и демокрация. Личността на Васил Левски продължава и ще продължава да привлича вниманието на нацията, да събира в себе си онова родолюбие и отдаденост на една свята кауза, за която си заслужава да се живее. И да се умре, на което са способни малцина от нас... И това е доказателство за безсмъртието на идеите на Апостола на свободните българи.\r\n\r\nАлманах. Васил Левски - Стратег и творец на революцията е поредното бижу в колекцията алманаси, посветени на България. Тазгодишното издание на телевизионната продукция Фермата проследява живота и дейността на Васил Левски. От предишните издания можете да научите повече за природата и гъбите в България - Алманах. Природните богатства на България - Златна книга, за историята на България в Алманах. История на българщината. Богатството, красотата и многообразието на българските обичаи са описани в Алманах. Традиции и празници на българите, а ако искате да проследите териториите от българското етнокултурно пространство, които са останали извън днешните ни държавни граници - това може да се случи в Алманах. По следите на България.\r\n\r\nПопълни семейната библиотека с луксозното издание!', 9, 0x313733333833333130315f312e6a7067, 'Български'),
(31, 'Алманах. Природните богатства на България Златна книга', 'Цвета Бучкова', 'Българска история', 320, ' Диворастящи гъби. Лечебни растения. Минерални води.\r\n\r\nАлманах. Природните богатства на България е четвъртото издание на телевизионната продукция Фермата, което огромен брой хора очакват с нетърпение. Кои са темите, които ще открием в редовете на новото издание и с какво ще ни изненада то?\r\n\r\nКнигата ще ви разкрие изобилието, с което природата е дарила нашата родина, от разнообразието на диворастящите гъби, през лечебните растения до уникалността на минералните извори и находища с лечебна кал. На страниците на тази книга читателят ще намери изчерпателни описания и на над 130 диворастящи гъби, над 70 лечебни растения и над 40 минерални извора, както и тяхното приложение при лечението на различни заболявания. Изданието ще ви разкрие природната съкровищница на България и ще ви научи как да я използвате и цените.\r\n\r\nПредишните издания на Фермата разглеждат историята на България в Алманах. История на българщината, отразяват богатството, красотата и многообразието на българските обичаи в Алманах. Традиции и празници на българите, както и проследяват териториите, от българското етнокултурно пространство, които са останали извън днешните ни държавни граници в Алманах. По следите на България.\r\n\r\nАлманах. Природните богатства на България е луксозно издание с твърди корици и гланцирани страници, което го прави перфектен подарък за всички любители на българската природа. Книгата е стойностно допълнение към всяка семейна библиотека.', 9, 0x313733333833333136315f312e6a7067, 'Български'),
(32, 'Алманах. По следите на България', 'Пламен Павлов', 'Българска история', 304, ' \"Алманах. По следите на България\" е третото издание на телевизионната продукция \"Фермата\", което огромен брой хора очакват с нетърпение. Кои са темите, които ще открием в редовете на новото издание и с какво ще ни изненада то?\r\n\r\nНовият алманах е посветен на исторически разказ за земите около България, които някога са били населени с българи. Някои от тях все още се населяват с българи - кои са те, разбери сам.\r\n\r\n\"Алманах. По следите на България\" е удивително изследване на териториите, от българското етнокултурно пространство, които са останали извън днешните ни държавни граници. На страниците на тази книга читателят ще намери изчерпателни сведения и неоспорими доказателства за величието на българската история - от древността почти до наши дни.\r\nПредлагайки проницателен преглед на ключовите исторически етапи \"Алманах. По следите на България\" има за цел да сближи хората, независимо от техния произход и самосъзнание.\r\n\r\nПредишните издания на \"Фермата\" разглеждат историята на България, проследена в \"Алманах. История на българщината\" и богатството, красотата и многообразието на българските обичаи, отразени в \"Алманах. Традиции и празници на българите\".\r\n\r\n\"Алманах. По следите на България\" е луксозно издание с твърди корици и гланцирани страници, което го прави перфектен подарък за всички любители на българската история. Книгата е стойностно допълнение към всяка семейна библиотека, която ще направи миналото ни достъпно за всеки.\r\n', 9, 0x313733333833333231355f312e6a7067, 'Български'),
(33, 'България: Кратки хроники - книга 1', 'Пламен Павлов', 'Българска история', 280, ' В книга първа са проследени редица слабо известни или напълно непознати събития и личности от миналото на българските земи - от праисторическите епохи до гибелта на средновековната българска държава. За разлика от популярните Български хроники на Стефан Цанев, книгата включва научнопопулярни текстове, обединени в тематични раздели. В тях са разгледани важни проблеми от най-древното минало, известни и малко познати факти за Първото и Второто българско царство, знаменити, но и забравени духовни водачи, някои пренебрегнати творби от историята на средновековната българска литература. Читателят ще открие нова информация за откритията в пещерите Козарника и Бачо Киро, за неолитната революция и цивилизацията Варна, както и ще се запознае с някои антични и византийски сюжети, включително за Древна Македония, прочутия Спартак, римски и византийски императори от тракийско потекло... Ще се срещне със знаменитите владетели Кубрат, Симеон Велики, Иван Асен II, Ивайло и Иван Шишман, но и със слабо познати личности и видни духовни водачи - както на православието, така и на великата българска ерес.\r\n\r\nБългария: Кратки хроники е проект в две книги на издателство Изток - Запад.\r\n\r\nПламен Павлов е български историк, поет, публицист, телевизионен водещ. Роден е на 12 юли 1958 г. Завършва история във ВТУ Св. св. Кирил и Методий (1982), където от 1984 г. преподава история на Византия и средновековните балкански държави. От август 1998 до март 2002 г. е председател на Агенцията за българите в чужбина към Министерския съвет. Работи за развитието на хоризонталните връзки между български дружества и организации от целия свят, като поставя акцент на т.нар. исторически общности в Украйна, Молдова, Румъния, Северна Македония, Албания, Гърция, Западните покрайнини и други. Инициатор и участник в създаването на различни научни, културни и обществени проекти. Пламен Павлов е автор на около 150 научни студии, книги, учебници, енциклопедични издания.', 9, 0x313733333833333237315f312e6a7067, 'Български');

-- --------------------------------------------------------

--
-- Table structure for table `favorite_books_users`
--

CREATE TABLE `favorite_books_users` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `favorite_books_users`
--

INSERT INTO `favorite_books_users` (`id`, `user_id`, `book_id`) VALUES
(41, 9, 6),
(45, 9, 7),
(50, 9, 8),
(51, 9, 25),
(52, 9, 11);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`) VALUES
(4, 'ivo', 'ivo@abv.bg', '$2y$10$ZhA9ojNVnEowkLvAFhzRe.bCydX2YrfN7lF4j4Gs8xdzqYBB/dC6i'),
(7, 'ssss', 'ssss@ssss.sss', '$2y$10$TfF/Y7hDgCk30f5AWdL9/.gQhQKZe63m.u0QNewgKsfwlxh7nqMyS'),
(8, 'oiujhg', 'kjhg@dfg.td', '$2y$10$bkgK3TMXbsbEQghr4g.87ew9WMp08tKsY11f7qK5WT5icQ0nzjPQu'),
(9, 'ema', 'ema1@abv.bg', '$2y$10$kdCPajpLZVvk.NfT0sgPLenIztAUl0vpk/uOVCEEyYiN748tAkPEK'),
(10, 'sadi', 'sadi@abv.bg', '$2y$10$DYhmcV91B5W5ORajwMbDOegB88PzlWQ0GWi50LO3V18gY01KQ6B9S'),
(11, 'asdf', 'hgfd@asdf.fd', '$2y$10$7hjDPavjmN7Ub22IsSrZruEAvNpzwnDztOwVoo9ZuRO8z9U3WiMsC');

-- --------------------------------------------------------

--
-- Table structure for table `user_progress`
--

CREATE TABLE `user_progress` (
  `user_id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL,
  `current_page` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_progress`
--

INSERT INTO `user_progress` (`user_id`, `book_id`, `current_page`) VALUES
(9, 5, 210),
(9, 8, 210),
(9, 19, 120);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `favorite_books_users`
--
ALTER TABLE `favorite_books_users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `book_id` (`book_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `user_progress`
--
ALTER TABLE `user_progress`
  ADD PRIMARY KEY (`user_id`,`book_id`),
  ADD KEY `book_id` (`book_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `favorite_books_users`
--
ALTER TABLE `favorite_books_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `books`
--
ALTER TABLE `books`
  ADD CONSTRAINT `user_id` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `favorite_books_users`
--
ALTER TABLE `favorite_books_users`
  ADD CONSTRAINT `favorite_books_users_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `favorite_books_users_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_progress`
--
ALTER TABLE `user_progress`
  ADD CONSTRAINT `FK_user_id` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_progress_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `user_progress_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
